#include "queue.h"

int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int choice = -1;
	queue q;
	short el = 0; 
	while (true) {
		cout << "----------------------------------------------------------" << endl;
		cout << "0 - Зчитати з файлу" << endl;//
		cout << "1 - Додати елемент" << endl; // Add
		cout << "2 - Вивести список" << endl; // show
		cout << "3 - Знайти та вивести кількість елементів черги;" << endl; // count
		cout << "4 - Знайти та вивести середнє арифметичне збережених елементів" << endl; // avarage
		cout << "5 - Знайти та вивести мінімальний елемен" << endl; //
		cout << "6 - Знайти та вивести максимальний елемен" << endl;
		cout << "7 - Знайти та вивести елемент, що йде перед мінімальним елементом" << endl; //
		cout << "8 - Зберігти у файл" << endl;
		cout << "9 - Вихід" << endl;// + ~  
		cout << "---------------------------" << endl;

		cin >> choice;

		switch (choice) {
		case 0:
			q.readFile();
			q.show();
			cout << "----------------------------------------------------------" << endl;
			break;
		case 1:
			cout << "Введіть елемент (short int) > ";
			cin >> el;
			q.Add(el);
			q.show();
			cout << "----------------------------------------------------------" << endl;
			break;
		case 2:
			q.show();
			cout << "----------------------------------------------------------" << endl;
			break;

		case 3:
			q.show();
			cout << q.count() << endl;
			cout << "----------------------------------------------------------" << endl;
			break;

		case 4:
			q.show();
			cout << q.average() << endl;
			cout << "----------------------------------------------------------" << endl;
			break;

		case 5:
			q.show();
			cout << q.Min() << endl;
			cout << "----------------------------------------------------------" << endl;
			break;

		case 6:
			q.show();
			cout << q.Max() << endl;
			cout << "----------------------------------------------------------" << endl;
			break;

		case 7:
			q.show();
			cout << q.prevMin() << endl;
			cout << "----------------------------------------------------------" << endl;
			break;

		case 8:
			q.saveFile();
			cout << "чергу збережено" << endl;
			cout << "----------------------------------------------------------" << endl;
			break;

		case 9:
			cout << "Вихід..." << endl;
			cout << "----------------------------------------------------------" << endl;
			return 1;

		default:
			cout << "Ви ввели невірний номер" << endl;
			break;

		}
	}


	return 0;
}